# Ultralytics YOLO н†љнЇА, AGPL-3.0 license
# YOLO11 with GFPN and decoupled CMEA output (Ref: image_b095ad.png)

nc: 80 
scales:
  n: [0.50, 0.25, 1024] 

# Backbone дњЭжМБдЄНеПШ
backbone:
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 2, C3k2_ScConv, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 2, C3k2_ScConv, [512, False, 0.25]]
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 2, C3k2_ScConv, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 2, C3k2_ScConv, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]] # 9
  - [-1, 2, C2PSA, [1024]] # 10

# Head дњЃжФєиѓіжШОпЉЪеЫЮдЉ†ињЮзЇњжФєдЄЇдїО C3k2 ж®°еЭЧеЉХеЗЇпЉМиАМйЭЮдїО CMEA еЉХеЗЇ
head:
  # ---------------- GFPN еИЭеІЛиБЪеРИ ----------------
  - [-1, 1, Conv, [512, 1, 1]] # 11
  - [6, 1, Conv, [512, 3, 2]]  # 12
  - [[-1, 11], 1, Concat, [1]] # 13
  - [-1, 2, C3k2, [512, False]] # 14 (High-level feat)

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 15
  - [4, 1, Conv, [256, 3, 2]] # 16
  - [[15, -1, 6], 1, Concat, [1]] # 17
  - [-1, 2, C3k2, [512, False]] # 18 (Mid-level feat)

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 19
  - [[-1, 4], 1, Concat, [1]] # 20
  
  # ---------------- P3 Branch ----------------
  - [-1, 2, C3k2, [256, False]] # 21 (P3 иЮНеРИдЄїиКВзВє)
  - [-1, 1, CMEA, []]           # 22 <--- дїЕдљЬдЄЇ Detect иЊУеЕ• (P3)

  # ---------------- P4 Branch ----------------
  - [21, 1, Conv, [256, 3, 2]]  # 23 <--- дњЃжФєзВєпЉЪдїО 21 (C3k2) еЉАеІЛдЄЛйЗЗж†ЈпЉМдЄНеЖНйАЪињЗ 22 (CMEA)
  - [[-1, 18], 1, Concat, [1]]  # 24
  - [-1, 2, C3k2, [512, False]] # 25 (P4 иЮНеРИдЄїиКВзВє)
  - [-1, 1, CMEA, []]           # 26 <--- дїЕдљЬдЄЇ Detect иЊУеЕ• (P4)

  # ---------------- P5 Branch ----------------
  - [18, 1, Conv, [256, 3, 2]]  # 27
  - [25, 1, Conv, [256, 3, 2]]  # 28 <--- дњЃжФєзВєпЉЪдїО 25 (C3k2) еЉАеІЛдЄЛйЗЗж†ЈпЉМдЄНеЖНйАЪињЗ 26 (CMEA)
  - [[14, 27, -1], 1, Concat, [1]] # 29
  - [-1, 2, C3k2, [1024, True]] # 30 (P5 иЮНеРИдЄїиКВзВє)
  - [-1, 1, CMEA, []]           # 31 <--- дїЕдљЬдЄЇ Detect иЊУеЕ• (P5)

  # ---------------- Detect ----------------
  - [[22, 26, 31], 1, Detect, [nc]] # 32